let Q0 = "Ты часто гуляешь? ";

var A0 = "1)постоянно 2)не часто 3)редко 4)очень редко 5)сижу дома";

var Q_1 = "где ты обычно гуляешь?";
var Q_2 = "когда ты гуляешь?";
var Q_3 = "у тебя нет времени гулять?";
var Q_4 = "ты вообще ходишь куда-нибудь?";
var Q_5 = "ты хикикомори?";
///////////////////

///////////////////
var A01 = "1)по дороге до колледжа 2)в парке 3)в лесу 4)во дворе  5)как можно дальше от дома ";
var A02 = "1)только по выходным 2)когда выдается свободный часок 3)на каникулах, если повезет 4)только летом  5)когда хожу в магазин ";
var A03 = "1)работа 2)учеба 3)учить много надо 4)учеба и работа, не до прогулок  5)много... ";
var A04 = "1)иногда, в кино 2)угу, за хлебом 3)конечно, доставку забрать 4)неа  5)хмммм.... ничего на ум не приходит ";
var A05 = "1)а это кто? 2)я? нееееее 3)угусь 4)хики-задрот  5)нет конечно ";

var Q_11 = "Ты учишься в колледже?";
var Q_12 = "Где-то рядом есть парк?";
var Q_13 = "Ты где вообще живешь";
var Q_14 = "У твоего дома есть двор?";
var Q_15 = "Ты не любишь быть дома?";
///////////////////

///////////////////
var A011 = "1)да 2)нет, просто хожу до какого-то колледжа 3)там учится друг 4)уже заканчиваю  5)хожу на курсы, которые там проводят ";
var A012 = "1)да, в двух шагах от дома 2)нет, езжу до ближайшего 3)ходу до ближайшего парка 4)да, мы там с другом иногда встречаемся  5)нет, я так называю аллею ";
var A013 = "1)в деревне 2)за городом 3)на краю города 4)возле дендропарка  5)хаха, лесом я называю пять ближайших деревьев";
var A014 = "1)да, он довольно большой 2)да, даже спортивная площадка есть  3)нет, просто рядом с домом гуляю 4)нет, гуляю в соседнем дворе  5)нет, гуляю во дворе у друга ";
var A015 = "1)нет,мама быстро загоняет домой 2)нет, постоянно отправляют в магазин 3)просто люблю длительные прогулки 4)просто нравится гулять в парке, а далеко  5)лес далеко от дома ";
///////////////////

///////////////////
var Q_21 = "Почему так?";
var Q_22 = "Ты так сильно занят?";
var Q_23 = "Почему, если повезет?";
var Q_24 = "Почему только летом";
var Q_25 = "А ты часто ходишь в магазин?";

var A021 = "1)очень много работы 2)много домашки 3)много дел по хозяйству 4)мне лень куда-то ходить  5)друзья свободны только в выходные ";
var A022 = "1)ага, работа 2)ага, учеба 3)дела... 4)типо того  5)предпочитаю умственный труд ";
var A023 = "1)долги по учебе 2)если дома работой не завалят 3)погода может быть так себе 4)может пойти дождь  5)не пойду, если будет слишком жарко ";
var A024 = "1)не люблю мороз 2)уезжаю в деревню 3)летом уезжаю к родителям 4)хоть какой-то отдых от учебы  5)обожаю гулять по полям ";
var A025 = "1)ну может раз в неделю 2)раза два в неделю 3)раз в месяц 4)два раза в месяц  5)ну очень редко, пользуюсь доставкой ";
///////////////////

///////////////////
var Q_31 = "Много работаешь?";
var Q_32 = "С учебой нет времени гулять?";
var Q_33 = "Настолько много, что нет времени на прогулку?";
var Q_34 = "Учеба и работа одновременно?";
var Q_35 = "Тогда почему не гуляешь?";
///////////////////

///////////////////
var A031 = "1)ага, до позднего вечера 2)возвращаюсь ночью 3)ага, в ночную смену 4)да, еще дети  5)немного, но много других дел ";
var A032 = "1)есть, это просто отговорка 2)ага, домашки много 3)с трудом понимаю, что нужно делать 4)есть, но я не особо хочу  5)состою в спортивной секции ";
var A033 = "1)да 2)не настолько 3)нет, конечно 4)  5)нет ";
var A034 = "1)ну да 2)жить же на что-то надо 3)надо за учебу платить 4)снимаю квартиру, нужны деньги  5)ага, хочу сразу после учебы квартиру купить ";
var A035 = "1)хочу прочитать все, купленные книги 2)да в играх постоянно ивенты 3)мне слишком лень 4)напряжно  5)лень одеваться ";
///////////////////

///////////////////
var Q_41 = "А кинотеатр далеко?";
var Q_42 = "Только за хлебом?";
var Q_43 = "ты только заказываешь?";
var Q_44 = "серьезно? Совсем никуда не ходишь?";
var Q_45 = "То есть ты сидишь дома?";

var A041 = "1)в соседнем доме 2)как-то не думал об этом 3)ее помню, редко же там бываю 4)не знаю, я пользуюсь телепортом  5)какой кинотеатр? ";
var A042 = "1)ну да 2)конечно 3)еще дошик 4)всякую фигню еще покупаю за одно  5)нет ";
var A043 = "1)конечно 2)ну да, а смысл эти тяжести таскать? 3)нет, иногда кого-нибудь прошу 4)не я  5)мне заказывают ";
var A044 = "1)на полном серьезе 2)походу да 3)ээээээээ, а ты сам-то ходишь? 4)хожу конечно  5)я же шучу ";
var A045 = "1)да 2)хмммм...да 3)хммм....нет, лежу 4)летаю  5)сижу на улице ";
///////////////////

///////////////////
var Q_51 = "Мдааааа, точно хики!";
var Q_52 = "Вот ты и спалился!";
var Q_53 = "Даже не скрываешь?";
var Q_54 = "Ты что этим гордишься?";
var Q_55 = "Тогда почему сидишь дома?";

var A051 = "1) 2) 3) 4)  5) ";
var A052 = "1) 2) 3) 4)  5) ";
var A053 = "1) 2) 3) 4)  5) ";
var A054 = "1) 2) 3) 4)  5) ";
var A055 = "1) 2) 3) 4)  5) ";
////////////////

///////////////////
var Q_111 = "1";
var Q_112 = "2";
var Q_113 = "3";
var Q_114 = "4";
var Q_115 = "5";

var A0111 = "1";
var A0112 = "2";
var A0113 = "3";
var A0114 = "4";
var A0115 = "5";
///////////////////

///////////////////
var Q_121 = "1";
var Q_122 = "2";
var Q_123 = "3";
var Q_124 = "4";
var Q_125 = "5";

var A0121 = "1";
var A0121 = "2";
var A0123 = "3";
var A0124 = "4";
var A0125 = "5";
///////////////////

///////////////////
var Q_131 = "1";
var Q_132 = "2";
var Q_133 = "3";
var Q_134 = "4";
var Q_135 = "5";

var A0131 = "1";
var A0132 = "2";
var A0133 = "3";
var A0134 = "4";
var A0135 = "5";
///////////////////

///////////////////
var Q_141 = "1";
var Q_142 = "2";
var Q_143 = "3";
var Q_144 = "4";
var Q_145 = "5";

var A0141 = "1";
var A0142 = "2";
var A0143 = "3";
var A0144 = "4";
var A0145 = "5";
///////////////////

///////////////////
var Q_151 = "1";
var Q_152 = "2";
var Q_153 = "3";
var Q_154 = "4";
var Q_155 = "5";

var A0151 = "1";
var A0152 = "2";
var A0153 = "3";
var A0154 = "4";
var A0155 = "5";
///////////////////


let a;
let b;
let c;
let d;
let e;
var N = 1;
var A = 0;

alert("Начнем?")
//Q0="Ты часто гуляешь? "
alert(Q0)
var AL = 'A'
var Q = 'Q_'

for(var i = 1; i<=8; i++) //цикл программы
{
    
    AL += A;
    //alert(AL); // для отладки, проверки значения AL
    alert(window[AL])
    A = prompt();
    Q += A;
    var QST = window[Q]
    //alert(Q) // для отладки, проверки значения Q
    alert(QST)

}




alert("")



